html/how-to-write-a-good-software-design-doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>How to write a good software design doc</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">How to write a good software design doc</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Why write a design document?</a></li>
<li><a href="#sec-2">2. What to include in a design doc?</a></li>
<li><a href="#sec-3">3. How to write it</a></li>
<li><a href="#sec-4">4. Process</a></li>
</ul>
</div>
</div>
<p>
<a href="https://medium.freecodecamp.org/how-to-write-a-good-software-design-document-66fcf019569c">https://medium.freecodecamp.org/how-to-write-a-good-software-design-document-66fcf019569c</a>
</p>

<p>
As a software engineer, I spend a lot of time reading and writing design documents. After having gone through hundreds of these docs, I’ve seen first hand a strong correlation between good design docs and the ultimate success of the project. 好的设计文档和项目成功偶遇很强的正相关性
</p>

<p>
The article is split into 4 sections:
</p>
<ul class="org-ul">
<li>Why write a design document
</li>
<li>What to include in a design document
</li>
<li>How to write it
</li>
<li>and the Process around it
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Why write a design document?</h2>
<div class="outline-text-2" id="text-1">
<p>
A design doc is the most useful tool for making sure the right work gets done.
</p>

<p>
The main goal is to make you more effective by forcing you to think through the design and gather feedback from others. People often think the point of a design doc is to to teach others about some system or serve as documentation later on. While those can be beneficial side effects, they are not the goal in and of themselves.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What to include in a design doc?</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>title and people 包括作者和审核者
</li>
<li>overview. 简单地描述项目
</li>
<li>context. 项目背景
</li>
<li>goals and non-goals. 预期结果，以及这个项目不做哪些事情
</li>
<li>milestones. 包括时间点和目标
</li>
<li>current solution. 当前的解决方案是什么。可以以user story方式呈现出来。
</li>
<li>proprosed solution. 也称作technical architecture.
</li>
<li>alternative solutions. 其他方案，对比优缺点
</li>
<li>monitoring and altering. 如何做监控和报警，如何从外部评估项目如何
</li>
<li>cross-team impact 跨团队评估影响，这个还蛮重要的，需要其他团队什么资源和配合
</li>
<li>discussion. 一些还不确定或者是还有争议的地方，以及未来的想法
</li>
<li>detailed scoping and timeline. 具体如何执行
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> How to write it</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Write as simply as possible. Don’t try to write like the academic papers you’ve read. They are written to impress journal reviewers. Your doc is written to describe your solution and get feedback from your teammates. You can achieve clarity by using: （不像是学术论文一样去取悦审稿人）
<ul class="org-ul">
<li>Simple words
</li>
<li>Short sentences
</li>
<li>Bulleted lists and/or numbered lists
</li>
<li>Concrete examples, like “User Alice connects her bank account, then …”
</li>
</ul>
</li>
<li>Add lots of charts and diagrams
</li>
<li>Include numbers. The scale of the problem often determines the solution. To help reviewers get a sense of the state of the world, include real numbers like # of DB rows, # of user errors, latency — and how these scale with usage (remember your Big-O notations?). （当前系统需要解决问题的量级）
</li>
<li>Try to be funny
</li>
<li>Do the Skeptic Test
</li>
<li>Do the Vacation Test. If you go on a long vacation now with no internet access, can someone on your team read the doc and implement it as you intended? The main goal of a design doc is not knowledge sharing, but this is a good way to evaluate for clarity so that others can actually give you useful feedback.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Process</h2>
<div class="outline-text-2" id="text-4">
<p>
First of all, everyone working on the project should be a part of the design process. It’s okay if the tech lead ends up driving a lot of the decisions, but everyone should be involved in the discussion and buy into the design. So the “you” throughout this article is a really plural “you” that includes all the people on the project. （每个参与项目的人都要参与到设计过程里面来）
</p>

<p>
First of all, everyone working on the project should be a part of the design process. It’s okay if the tech lead ends up driving a lot of the decisions, but everyone should be involved in the discussion and buy into the design. So the “you” throughout this article is a really plural “you” that includes all the people on the project.（可以尝试一些prototype code来验证想法，在编写正式代码之前）
</p>

<p>
在编写正式文档之前，最好先和有经验的工程师谈谈自己的想法，可以得到许多有价值的反馈，同时避免许多设计上的坑
</p>

<p>
After that, as you start to have some idea of how to go about your project, do the following:
</p>
<ul class="org-ul">
<li>Ask an experienced engineer or tech lead on your team to be your reviewer. Ideally this would be someone who’s well respected and/or familiar with the edge cases of the problem. Bribe them with boba if necessary.
</li>
<li>Go into a conference room with a whiteboard.
</li>
<li>Describe the problem that you are tackling to this engineer (this is a very important step, don’t skip it!).
</li>
<li>Then explain the implementation you have in mind, and convince them this is the right thing to build.
</li>
</ul>

<p>
Doing all of this before you even start writing your design doc lets you get feedback as soon as possible, before you invest more time and get attached to any specific solution. Often, even if the implementation stays the same, your reviewer is able to point out corner cases you need to cover, indicate any potential areas of confusion, and anticipate difficulties you might encounter later on.
</p>
</div>
</div>
</div>
</body>
</html>
